## Terraform Plan Results

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fastly_service_vcl.mealfinding will be created
  + resource "fastly_service_vcl" "mealfinding" {
      + activate           = true
      + active_version     = (known after apply)
      + cloned_version     = (known after apply)
      + comment            = "Managed by Terraform"
      + default_ttl        = 3600
      + force_destroy      = false
      + force_refresh      = (known after apply)
      + http3              = true
      + id                 = (known after apply)
      + imported           = (known after apply)
      + name               = "mealfinding-production"
      + stage              = false
      + staged_version     = (known after apply)
      + stale_if_error     = true
      + stale_if_error_ttl = 86400

      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + cache_setting {
          + action          = "cache"
          + cache_condition = "is_html_request"
          + name            = "cache_html_pages"
          + stale_ttl       = 3600
          + ttl             = 3600
        }
      + cache_setting {
          + action          = "cache"
          + cache_condition = "is_static_asset"
          + name            = "cache_static_assets"
          + stale_ttl       = 86400
          + ttl             = 86400
        }
      + cache_setting {
          + action          = "pass"
          + cache_condition = "is_api_request"
          + name            = "pass_api_requests"
        }

      + condition {
          + name      = "is_api_request"
          + priority  = 10
          + statement = "req.http.host == \"api.mealfinding.com\""
          + type      = "REQUEST"
        }
      + condition {
          + name      = "is_html_request"
          + priority  = 30
          + statement = "req.url.ext == \"html\" || req.url.path ~ \"^/[^.]*$\""
          + type      = "REQUEST"
        }
      + condition {
          + name      = "is_static_asset"
          + priority  = 20
          + statement = "req.url.ext ~ \"^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$\""
          + type      = "REQUEST"
        }

      + domain {
          + comment = "API subdomain"
          + name    = "api.mealfinding.com"
        }
      + domain {
          + comment = "Apex domain"
          + name    = "mealfinding.com"
        }
      + domain {
          + comment = "Primary www subdomain for web frontend"
          + name    = "www.mealfinding.com"
        }

      + gzip {
          + content_types = [
              + "text/html",
              + "application/x-javascript",
              + "text/css",
              + "application/javascript",
              + "text/javascript",
              + "application/json",
              + "application/vnd.ms-fontobject",
              + "application/x-font-opentype",
              + "application/x-font-truetype",
              + "application/x-font-ttf",
              + "application/xml",
              + "font/eot",
              + "font/opentype",
              + "font/otf",
              + "image/svg+xml",
              + "image/vnd.microsoft.icon",
              + "text/plain",
              + "text/xml",
            ]
          + extensions    = [
              + "css",
              + "js",
              + "html",
              + "eot",
              + "ico",
              + "otf",
              + "ttf",
              + "json",
              + "svg",
              + "xml",
              + "txt",
            ]
          + name          = "gzip_standard"
        }

      + header {
          + action        = "delete"
          + destination   = "http.Server"
          + ignore_if_set = false
          + name          = "remove_server"
          + priority      = 50
          + regex         = (known after apply)
          + source        = (known after apply)
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "delete"
          + destination   = "http.X-Powered-By"
          + ignore_if_set = false
          + name          = "remove_x_powered_by"
          + priority      = 50
          + regex         = (known after apply)
          + source        = (known after apply)
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Content-Security-Policy"
          + ignore_if_set = false
          + name          = "add_csp"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"default-src 'self'; script-src 'self' 'unsafe-inline' 'unsafe-eval'; style-src 'self' 'unsafe-inline'; img-src 'self' data: https:; font-src 'self' data:; connect-src 'self' https://api.mealfinding.com\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Referrer-Policy"
          + ignore_if_set = false
          + name          = "add_referrer_policy"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"strict-origin-when-cross-origin\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Strict-Transport-Security"
          + ignore_if_set = false
          + name          = "add_hsts"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"max-age=31536000; includeSubDomains; preload\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.X-Content-Type-Options"
          + ignore_if_set = false
          + name          = "add_xcto"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"nosniff\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.X-Frame-Options"
          + ignore_if_set = false
          + name          = "add_xfo"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"SAMEORIGIN\""
          + substitution  = (known after apply)
          + type          = "response"
        }

      + request_setting {
          + bypass_busy_wait = false
          + force_miss       = false
          + force_ssl        = true
          + name             = "force_ssl"
          + timer_support    = false
        }

      + vcl {
          + content = <<-EOT
                # Custom VCL for Mealfinding CDN
                # Handles subdomain-based routing, cache key customization, and error handling
                
                # ============================================
                # BACKEND DECLARATIONS (auto-generated by Terraform)
                # Reference names: F_web_origin, F_api_origin
                # ============================================
                
                sub vcl_recv {
                  #FASTLY recv
                
                  # ----------------------------------------
                  # Backend Selection Based on Subdomain
                  # ----------------------------------------
                
                  # Route API subdomain to API backend
                  if (req.http.host == "api.mealfinding.com") {
                    set req.backend = F_api_origin;
                  }
                  # Route www and apex domain to web backend
                  else if (req.http.host ~ "^(www\.)?mealfinding\.com$") {
                    set req.backend = F_web_origin;
                  }
                  # Default fallback to web backend
                  else {
                    set req.backend = F_web_origin;
                  }
                
                  # ----------------------------------------
                  # Force HTTPS
                  # ----------------------------------------
                  if (!req.http.Fastly-SSL) {
                    error 801 "Force HTTPS";
                  }
                
                  # ----------------------------------------
                  # Redirect apex to www (optional - commented out by default)
                  # ----------------------------------------
                  # if (req.http.host == "mealfinding.com") {
                  #   error 802 "Redirect to www";
                  # }
                
                  # ----------------------------------------
                  # Normalize Accept-Encoding for better cache hit ratio
                  # ----------------------------------------
                  if (req.http.Accept-Encoding) {
                    if (req.http.Accept-Encoding ~ "br") {
                      set req.http.Accept-Encoding = "br";
                    } elsif (req.http.Accept-Encoding ~ "gzip") {
                      set req.http.Accept-Encoding = "gzip";
                    } else {
                      unset req.http.Accept-Encoding;
                    }
                  }
                
                  # ----------------------------------------
                  # Strip query params from static assets for better cache hit ratio
                  # ----------------------------------------
                  if (req.url.ext ~ "^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$") {
                    set req.url = req.url.path;
                  }
                
                  # ----------------------------------------
                  # API: Don't cache requests with Authorization header
                  # ----------------------------------------
                  if (req.http.host == "api.mealfinding.com" && req.http.Authorization) {
                    return(pass);
                  }
                }
                
                sub vcl_hash {
                  #FASTLY hash
                
                  # Include host in cache key to separate www vs api content
                  set req.hash += req.http.host;
                }
                
                sub vcl_fetch {
                  #FASTLY fetch
                
                  # ----------------------------------------
                  # Static Assets: Set long TTL
                  # ----------------------------------------
                  if (req.url.ext ~ "^(js|css|png|jpg|jpeg|gif|ico|svg|woff|woff2|ttf|eot|webp|avif)$") {
                    # Cache static assets for 1 day at edge, allow stale for 7 days
                    set beresp.ttl = 86400s;
                    set beresp.stale_while_revalidate = 604800s;
                    set beresp.stale_if_error = 604800s;
                  }
                
                  # ----------------------------------------
                  # HTML: Set moderate TTL for SSG content
                  # ----------------------------------------
                  if (beresp.http.Content-Type ~ "text/html") {
                    set beresp.ttl = 3600s;
                    set beresp.stale_while_revalidate = 3600s;
                    set beresp.stale_if_error = 86400s;
                  }
                
                  # ----------------------------------------
                  # API: Respect Cache-Control headers, or don't cache
                  # ----------------------------------------
                  if (req.http.host == "api.mealfinding.com") {
                    # If origin doesn't set cache headers, don't cache
                    if (!beresp.http.Cache-Control) {
                      set beresp.ttl = 0s;
                      set beresp.uncacheable = true;
                      return(deliver);
                    }
                  }
                
                  # ----------------------------------------
                  # Don't cache error responses
                  # ----------------------------------------
                  if (beresp.status >= 500 && beresp.status < 600) {
                    set beresp.ttl = 0s;
                    set beresp.uncacheable = true;
                    return(deliver);
                  }
                }
                
                sub vcl_deliver {
                  #FASTLY deliver
                
                  # ----------------------------------------
                  # Add cache status header for debugging
                  # ----------------------------------------
                  if (resp.http.X-Cache) {
                    set resp.http.X-Cache = resp.http.X-Cache ", " if(fastly_info.state ~ "^HIT", "HIT", "MISS");
                  } else {
                    set resp.http.X-Cache = if(fastly_info.state ~ "^HIT", "HIT", "MISS");
                  }
                
                  # Add cache hits info
                  set resp.http.X-Cache-Hits = obj.hits;
                }
                
                sub vcl_error {
                  #FASTLY error
                
                  # ----------------------------------------
                  # Custom Error: Force HTTPS redirect
                  # ----------------------------------------
                  if (obj.status == 801) {
                    set obj.status = 301;
                    set obj.http.Location = "https://" + req.http.host + req.url;
                    set obj.response = "Moved Permanently";
                    synthetic {""};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom Error: Redirect apex to www
                  # ----------------------------------------
                  if (obj.status == 802) {
                    set obj.status = 301;
                    set obj.http.Location = "https://www.mealfinding.com" + req.url;
                    set obj.response = "Moved Permanently";
                    synthetic {""};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom 503 Error Page
                  # ----------------------------------------
                  if (obj.status == 503) {
                    set obj.http.Content-Type = "text/html; charset=utf-8";
                    synthetic {"
                <!DOCTYPE html>
                <html lang="en">
                <head>
                  <meta charset="UTF-8">
                  <meta name="viewport" content="width=device-width, initial-scale=1.0">
                  <title>Temporarily Unavailable - Mealfinding</title>
                  <style>
                    body { font-family: system-ui, sans-serif; max-width: 600px; margin: 100px auto; padding: 20px; text-align: center; }
                    h1 { color: #333; }
                    p { color: #666; }
                  </style>
                </head>
                <body>
                  <h1>We'll be right back</h1>
                  <p>Mealfinding is temporarily unavailable. Please try again in a few moments.</p>
                </body>
                </html>
                "};
                    return(deliver);
                  }
                
                  # ----------------------------------------
                  # Custom 404 Error Page
                  # ----------------------------------------
                  if (obj.status == 404) {
                    set obj.http.Content-Type = "text/html; charset=utf-8";
                    synthetic {"
                <!DOCTYPE html>
                <html lang="en">
                <head>
                  <meta charset="UTF-8">
                  <meta name="viewport" content="width=device-width, initial-scale=1.0">
                  <title>Page Not Found - Mealfinding</title>
                  <style>
                    body { font-family: system-ui, sans-serif; max-width: 600px; margin: 100px auto; padding: 20px; text-align: center; }
                    h1 { color: #333; }
                    p { color: #666; }
                    a { color: #0066cc; }
                  </style>
                </head>
                <body>
                  <h1>Page Not Found</h1>
                  <p>The page you're looking for doesn't exist. <a href="/">Go to homepage</a></p>
                </body>
                </html>
                "};
                    return(deliver);
                  }
                }
            EOT
          + main    = true
          + name    = "main"
        }
    }

  # fastly_tls_subscription.mealfinding will be created
  + resource "fastly_tls_subscription" "mealfinding" {
      + certificate_authority   = "lets-encrypt"
      + certificate_id          = (known after apply)
      + common_name             = "mealfinding.com"
      + configuration_id        = (known after apply)
      + created_at              = (known after apply)
      + domains                 = [
          + "api.mealfinding.com",
          + "mealfinding.com",
          + "www.mealfinding.com",
        ]
      + force_destroy           = false
      + force_update            = false
      + id                      = (known after apply)
      + managed_dns_challenge   = (known after apply)
      + managed_dns_challenges  = (known after apply)
      + managed_http_challenges = (known after apply)
      + state                   = (known after apply)
      + updated_at              = (known after apply)
    }

  # fastly_tls_subscription_validation.mealfinding will be created
  + resource "fastly_tls_subscription_validation" "mealfinding" {
      + id              = (known after apply)
      + subscription_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + active_version      = (known after apply)
  + domains             = [
      + "mealfinding.com",
      + "www.mealfinding.com",
      + "api.mealfinding.com",
    ]
  + fastly_cname        = "mealfinding.com.global.prod.fastly.net"
  + service_id          = (known after apply)
  + service_name        = "mealfinding-production"
  + tls_dns_challenges  = (known after apply)
  + tls_state           = (known after apply)
  + tls_subscription_id = (known after apply)

```

</details>

**Workflow Run:** https://github.com/sword42/mealfinding-cdn/actions/runs/20707535803
